---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ContinuousRailTransitionFailure
source: html/37c1f5ef-cf33-8ff3-ad06-613699cce942.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ContinuousRailTransitionFailure Property

Cannot create specified transition at rail path turn, hand Rail/Top Rail cannot maintain continuous.

## Syntax (C#)
```csharp
public static FailureDefinitionId ContinuousRailTransitionFailure { get; }
```